/* No comment provided by engineer. */
"Please choose a location to save your translation package" = "Please choose a location to save your translation package";

/* No comment provided by engineer. */
"Save" = "Save";

/* No comment provided by engineer. */
"Save Location" = "Save Location";

